#include"motor.h"

unsigned char code FFW[8]={0xf1,0xf3,0xf2,0xf6,0xf4,0xfc,0xf8,0xf9}; //反转顺序
/*******************************************************************************
* 函数名         : Motor
* 函数功能		   : 电机旋转函数
* 输入           : 无
* 输出         	 : 无
*******************************************************************************/

void  Motor()
{     
	unsigned char i;
	for(i=0;i<8;i++)
	{
		GPIO_MOTOR = FFW[i]&0x1f;  //取数据
		Delay(15);	//调节转速	
	}		                  
}
/*******************************************************************************
* 函数名         : Delay
* 函数功能		   : 延时
* 输入           : t
* 输出         	 : 无
*******************************************************************************/
void Delay(unsigned int t)
{                           
	unsigned int k;
	while(t--)
	{
		for(k=0; k<80; k++)
		{ }
	}
}
