#include"temp.h"
/*******************************************************************************
* 函数名         : Delay1ms
* 函数功能		   : 延时函数
* 输入           : 无
* 输出         	 : 无
*******************************************************************************/

void Delay1ms(unsigned int y)
{
	unsigned int x;
	for(y;y>0;y--)
		for(x=110;x>0;x--);
}
/*******************************************************************************
* 函数名         : Ds18b20Init
* 函数功能		   : 初始化
* 输入           : 无
* 输出         	 : 无
*******************************************************************************/

unsigned char Ds18b20Init()
{
	unsigned int i;
	EA=0;
	ds=0;
	i=100;
	while(i>0)i--;
	ds=1;
	i++;
	i=0;
	while(ds)
	{
		i++;
		if(i>500)
			return 0;	
	}
	return 1;
	EA=1;
}

/*******************************************************************************
* 函数名         : Ds18b20WriteCom
* 函数功能		   : 向18B20写入一个字节命令
* 输入           : com
* 输出         	 : 无
*******************************************************************************/

void Ds18b20WriteCom(unsigned char com)
{
	unsigned int i,j;
	EA=0;
	for(j=0;j<8;j++)
	{
		ds=0;
		i++;
		i++;
		ds=com&0x01;
		i=6;
		while(i>0)i--;
		ds=1;
		i++;
		i++;
		com>>=1;
	}
	EA=1;
}
/*******************************************************************************
* 函数名         : Ds18b20ReadByte
* 函数功能		   : 读取一个字节
* 输入           : com
* 输出         	 : 无
*******************************************************************************/


unsigned char Ds18b20ReadByte()
{
	unsigned char byte,bi;
	unsigned int i,j;	
	EA=0;
	for(j=8;j>0;j--)
	{
		ds=0;
		i++;
		ds=1;
		i++;
		i++;
		bi=ds;
		byte=(byte>>1)|(bi<<7);	  //将byte左移一位，然后与上右移7位后的bi
								  //注意移动之后移掉那位补0
		i=5;while(i)i--;
	}
	EA=1;				
	return byte;
}
/*******************************************************************************
* 函数名         : Ds18b20ChangTemp
* 函数功能		   : 让18b20开始转换温度
* 输入           : com
* 输出         	 : 无
*******************************************************************************/

void  Ds18b20ChangTemp()
{
	Ds18b20Init();
	Delay1ms(1);
	Ds18b20WriteCom(0xcc);		//跳过ROM操作命令		 
	Ds18b20WriteCom(0x44);	  //温度转换命令

}
/*******************************************************************************
* 函数名         : Ds18b20ReadTempCom
* 函数功能		   : 发送读取温度命令
* 输入           : com
* 输出         	 : 无
*******************************************************************************/

void  Ds18b20ReadTempCom()
{	

	Ds18b20Init();
	Delay1ms(1);
	Ds18b20WriteCom(0xcc);	 //跳过ROM操作命令
	Ds18b20WriteCom(0xbe);	 //发送读取温度命令
}
/*******************************************************************************
* 函数名         : Ds18b20ReadTemp
* 函数功能		   : 读取温度
* 输入           : com
* 输出         	 : 无
*******************************************************************************/

int Ds18b20ReadTemp()
{
	unsigned int temp=0;
	unsigned char tmh,tml;
	Ds18b20ChangTemp();			 	//先写入转换命令
	Ds18b20ReadTempCom();			//然后等待转换完后发送读取温度命令
	tml=Ds18b20ReadByte();		//读取温度值共16位，先读低字节
	tmh=Ds18b20ReadByte();		//再读高字节
	temp=tmh;
	temp<<=8;
	temp|=tml;
//	temp1=temp;
//	t=temp1*0.0625;		//18B20的分辨率是0.0625，将读取到的值乘以0.0625就是实际温度值
//	temp1=t*100	;//+(temp1>0?0.5:-0.5);//留两位有效值，并且四舍五入
	return temp;
}


